constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outerSides
    {
        type            overset;
        inGroups        1(overset);
        nFaces          160;
        startFace       41229;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40882;
        startFace       41389;
    }
    inlet
    {
        type            inlet;
        nFaces          85;
        startFace       82271;
        faces           ( ( 0 4 7 3 ) );
    }
    outlet
    {
        type            outlet;
        nFaces          85;
        startFace       82356;
        faces           ( ( 2 6 5 1 ) );
    }
    topAndBottom
    {
        type            patch;
        nFaces          170;
        startFace       82441;
    }
    hole
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       82611;
    }
)

// ************************************************************************* //
