system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

z 50;

vertices
(
    (-20  -20  -$z)
    ( 40  -20  -$z)
    ( 40   20  -$z)
    (-20   20  -$z)
    (-20  -20   $z)
    ( 40  -20   $z)
    ( 40   20   $z)
    (-20   20   $z)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (85 85 1) simpleGrading (1 1 1)

);

edges
();

boundary
(

   outerSides
    {
	type overset;
	faces
	();
    }	

   frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }

    inlet
    {
        type inlet;
   	faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type outlet;
        faces
        (
            (2 6 5 1)
        );
    }

    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);


// ************************************************************************* //
